sdaiSetErrorHandler(=FUNC:System.Void(System.UInt32))
\details
The Set Error Handler function shall place the specified error handling function on the last in, first out
error handler stack.
\remarks This function shall accept the error code as the only parameter and may be executed before
the Open Session function, during an SDAI session, and after the Close Session function.
The system default error handler may be placed on the stack by specifying a NULL function. Multiple
error handling functions may be placed on the stack. The most recently added error handling function
is at the top of the stack and shall automatically be invoked when an error condition occurs.
Possible error indicators:
sdaiSY_ERR Underlying system error